# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

list_1 = [2, -5, 8, 9, -25, 25, 4]
new_list = []

for i in list_1:
    if i >= 0 and i ** 0.5 == int(i ** 0.5):
        new_list.append(int(i ** 0.5))

print(new_list)

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)



days = ['', 'первое', 'второе', 'третье', 'четвертое', 'пятое',
       'шестое', 'седьмое', 'восьмое', 'девятое', 'десятое',
       'одиннадцатое', 'двенадцатое', 'тринадцатое', 'четырнадцатое',
       'пятнадцатое', 'шестнадцатое', 'семнадцатое', 'восемьнадцатое',
       'девятнадцатое', 'двадцатое', 'двадцать первое', 'двадцать второе',
       'двадцать третье', 'двадцать четвертое', 'двадцать пятое',
       'двадцать шестое', 'двадцать седьмое', 'двадцать восьмое', 'двадцать девятое',
       'тридцатое', 'тридцать первое']
months = ['', 'января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа',
         'сентября', 'октября', 'ноября', 'декабря']

date = input('Введите дату в формате dd.mm.yyyy: ')
day, month, year = date.split('.')
day = int(day)
month = int(month)

print(days[day], months[month], year, 'года')

#print(date)

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

import random

my_list = []
n = int(input('Введите количество элементов списка (от 10 до 100): '))

for n in range(n):
    my_list.append(random.randint(-100, 100))

print(my_list)

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

a = [1, 2, 4, 5, 6, 2, 5, 2]

list_1 = list(set(a))
print(list_1)

list_2 = []
for elem in a:
    if a.count(elem) == 1:
        list_2.append(elem)

print(list_2)
